tap "apple/apple"
tap "d12frosted/emacs-plus"
tap "felixkratz/formulae"
tap "gcenx/wine"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "jstkdng/programs"
tap "mczachurski/wallpapper"
tap "playcover/playcover"
brew "libpng"
brew "freetype"
brew "glib"
brew "pkg-config"
brew "gdk-pixbuf"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "aom"
brew "bat"
brew "bat-extras"
brew "bear"
brew "node"
brew "bitwarden-cli"
brew "boost"
brew "bottom"
brew "bvi"
brew "ccache"
brew "chafa"
brew "chezmoi"
brew "cmake"
brew "cmatrix"
brew "coreutils"
brew "cpufetch"
brew "llvm"
brew "crystal"
brew "dotnet"
brew "dua-cli"
brew "dust"
brew "exercism"
brew "eza"
brew "fastfetch"
brew "fd"
brew "libogg"
brew "unbound"
brew "gnutls"
brew "lame"
brew "libass"
brew "libbluray"
brew "libsamplerate"
brew "libvorbis"
brew "opus"
brew "libsndfile"
brew "ffmpeg"
brew "gcc"
brew "open-mpi"
brew "fish"
brew "freetds"
brew "fzf"
brew "gcc@12"
brew "gh"
brew "ghostscript"
brew "gifsicle"
brew "git"
brew "git-lfs"
brew "gitui"
brew "glfw"
brew "gnupg"
brew "go"
brew "gobject-introspection"
brew "graphviz"
brew "gsettings-desktop-schemas"
brew "helix"
brew "hexyl"
brew "hyfetch"
brew "hyperfine"
brew "shared-mime-info"
brew "libheif"
brew "python@3.9"
brew "imagemagick"
brew "jack"
brew "lf"
brew "libcaca"
brew "libgccjit"
brew "libgee"
brew "libpq"
brew "libsoundio"
brew "lolcat"
brew "luarocks"
brew "lynx"
brew "mackup"
brew "magic-wormhole"
brew "mas"
brew "media-info"
brew "ninja"
brew "micro"
brew "midnight-commander"
brew "minisign"
brew "molten-vk"
brew "mosh"
brew "mplayer"
brew "yt-dlp"
brew "mpv"
brew "navi"
brew "neofetch"
brew "neovim"
brew "nim"
brew "nmap"
brew "nnn"
brew "onefetch"
brew "openjdk"
brew "opus-tools"
brew "osc"
brew "pandoc"
brew "php"
brew "pnpm"
brew "portaudio"
brew "projectm"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pylint"
brew "python@3.10"
brew "ranger"
brew "ripgrep"
brew "rtaudio"
brew "rtmidi"
brew "rust-analyzer"
brew "samba"
brew "sdl12-compat"
brew "sevenzip"
brew "sk"
brew "starship"
brew "subversion"
brew "swift-format"
brew "swiftlint"
brew "syncthing", restart_service: true
brew "texlive"
brew "tldr"
brew "tmux"
brew "tokei"
brew "trash"
brew "tree"
brew "trunk"
brew "vala"
brew "vim"
brew "vitetris"
brew "viu"
brew "w3m"
brew "weechat"
brew "wget"
brew "winetricks"
brew "xplr"
brew "youtube-dl"
brew "zip"
brew "zls"
brew "zoxide"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-elrumo1-icon", "with-imagemagick", "with-native-comp", "with-xwidgets"]
brew "felixkratz/formulae/svim"
brew "jesseduffield/lazygit/lazygit"
brew "jstkdng/programs/ueberzugpp"
brew "mczachurski/wallpapper/wallpapper"
cask "alt-tab"
cask "amethyst"
cask "angry-ip-scanner"
cask "apparency"
cask "au-lab"
cask "balenaetcher"
cask "betterzip"
cask "blackhole-16ch"
cask "boop"
cask "cardinal"
cask "chatterino"
cask "crystalfetch"
cask "devtoys"
cask "discord"
cask "dolphin-beta"
cask "dozer"
cask "eloston-chromium"
cask "floorp"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-sans"
cask "font-jetbrains-mono"
cask "font-lexend"
cask "font-mononoki"
cask "font-mononoki-nerd-font"
cask "font-spleen"
cask "ghidra"
cask "gittyup"
cask "gitup"
cask "grandperspective"
cask "hammerspoon"
cask "handbrake"
cask "hex-fiend"
cask "hiddenbar"
cask "iina"
cask "imageoptim"
cask "inkscape"
cask "iterm2"
cask "karabiner-elements"
cask "keepingyouawake"
cask "keka"
cask "kitty"
cask "latest"
cask "libreoffice"
cask "linearmouse"
cask "logseq"
cask "mac-mouse-fix"
cask "mediainfo"
cask "middleclick"
cask "minecraft"
cask "mkvtoolnix"
cask "moonlight"
cask "musescore"
cask "native-access"
cask "netnewswire"
cask "obs"
cask "obsidian"
cask "openemu"
cask "openscad"
cask "parsec"
cask "playcover-community"
cask "prusaslicer"
cask "qbittorrent"
cask "qlimagesize"
cask "qlstephen"
cask "qlvideo"
cask "qmk-toolbox"
cask "raycast"
cask "reaper"
cask "sidequest"
cask "sioyek"
cask "sloth"
cask "sonic-visualiser"
cask "soundsource"
cask "stats"
cask "syntax-highlight"
cask "tempbox"
cask "textmate"
cask "thunderbird"
cask "tor-browser"
cask "transmission"
cask "utm"
cask "virtual-desktop-streamer"
cask "vlc"
cask "vscodium"
cask "wezterm"
cask "whisky"
cask "wine-crossover"
cask "xquartz"
cask "yattee"
cask "zettlr"
cask "zotero"
mas "AdGuard for Safari", id: 1440147259
mas "AmorphousDiskMark", id: 1168254295
mas "Bitwarden", id: 1352778147
mas "Color Picker", id: 1545870783
mas "com.jeremyvizzini.screentolayers.osx", id: 1077317077
mas "Dark Reader for Safari", id: 1438243180
mas "Developer", id: 640199958
mas "Drafts", id: 1435957248
mas "Dropover", id: 1355679052
mas "Final Cut Pro", id: 424389933
mas "forScore", id: 363738376
mas "Gifski", id: 1351639930
mas "Ground News", id: 1324203419
mas "Hush", id: 1544743900
mas "JellyCar Worlds", id: 1589010585
mas "Keynote", id: 409183694
mas "Logic Pro", id: 634148309
mas "Mactracker", id: 430255202
mas "MainStage", id: 634159523
mas "MusicHarbor", id: 1440405750
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PiPifier", id: 1160374471
mas "Pixelmator Pro", id: 1289583905
mas "Shazam", id: 897118787
mas "Surfshark", id: 1437809329
mas "Taio", id: 1527036273
mas "TestFlight", id: 899247664
mas "Tonebridge Guitar Effects", id: 1263858588
mas "Transporter", id: 1450874784
mas "Userscripts-Mac-App", id: 1463298887
mas "Velja", id: 1607635845
mas "Wayback Machine", id: 1472432422
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
